; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v9 ?v5)
             (pred_7 ?v8 ?v12)
             (pred_6 ?v9 ?v12)
             (pred_9 ?v10 ?v9 )
	     (pred_5 ?v9)
             (pred_11 ?v2)
             (pred_1 ?v8)
             (pred_3 ?v12)
             (pred_8 ?v9)
             (pred_2 ?v8)
             (pred_12 ?v9)
             (pred_4 ))



(:action op_4
:parameters (?v1 ?v13 ?v6 ?v4)
:precondition (and (pred_11 ?v1) (pred_11 ?v13) (pred_1 ?v6) (pred_3 ?v4)
          (pred_10 ?v1 ?v13) (pred_7 ?v6 ?v4)
                   (pred_6 ?v13 ?v4) (pred_5 ?v1) 
                   (pred_8 ?v13) (pred_2 ?v6))
:effect (and  (pred_12 ?v13) (not (pred_8 ?v13))))


(:action op_2
:parameters (?v1 ?v3)
:precondition (and (pred_11 ?v1) (pred_11 ?v3)
               (pred_5 ?v1) (pred_10 ?v1 ?v3) (pred_12 ?v3))
:effect (and (pred_5 ?v3) (not (pred_5 ?v1))))

(:action op_5
:parameters (?v1 ?v6)
:precondition (and (pred_11 ?v1) (pred_1 ?v6) 
                  (pred_5 ?v1) (pred_9 ?v6 ?v1) (pred_4 ))
:effect (and (pred_2 ?v6)
   (not (pred_9 ?v6 ?v1)) (not (pred_4 ))))


(:action op_1
:parameters (?v1 ?v7 ?v11)
:precondition (and (pred_11 ?v1) (pred_1 ?v7) (pred_1 ?v11)
                  (pred_5 ?v1) (pred_2 ?v11) (pred_9 ?v7 ?v1))
:effect (and (pred_2 ?v7) (pred_9 ?v11 ?v1)
        (not (pred_2 ?v11)) (not (pred_9 ?v7 ?v1))))

(:action op_3
:parameters (?v1 ?v6)
:precondition (and (pred_11 ?v1) (pred_1 ?v6) 
                  (pred_5 ?v1) (pred_2 ?v6))
:effect (and (pred_4 ) (pred_9 ?v6 ?v1) (not (pred_2 ?v6)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_02 obj_16 obj_01 obj_08 obj_11 obj_10 obj_20 obj_22 obj_18 obj_05 obj_03 obj_07 obj_19 obj_13 obj_21
    obj_14 obj_17 obj_04
    obj_09 obj_15 obj_12
    )

    (:init
       (pred_4)

       (pred_11 obj_06)
       (pred_11 obj_02)
       (pred_11 obj_16)
       (pred_11 obj_01)
       (pred_11 obj_08)
       (pred_11 obj_11)
       (pred_11 obj_10)
       (pred_11 obj_20)
       (pred_11 obj_22)
       (pred_11 obj_18)
       (pred_11 obj_05)
       (pred_11 obj_03)
       (pred_11 obj_07)
       (pred_11 obj_19)
       (pred_11 obj_13)
       (pred_11 obj_21)
       (pred_3 obj_14)
       (pred_3 obj_17)
       (pred_3 obj_04)
       (pred_1 obj_09)
       (pred_1 obj_15)
       (pred_1 obj_12)

       (pred_10 obj_06 obj_08)
       (pred_10 obj_06 obj_02)
       (pred_10 obj_02 obj_11)
       (pred_10 obj_02 obj_16)
       (pred_10 obj_02 obj_06)
       (pred_10 obj_16 obj_10)
       (pred_10 obj_16 obj_01)
       (pred_10 obj_16 obj_02)
       (pred_10 obj_01 obj_20)
       (pred_10 obj_01 obj_16)
       (pred_10 obj_08 obj_22)
       (pred_10 obj_08 obj_11)
       (pred_10 obj_08 obj_06)
       (pred_10 obj_11 obj_18)
       (pred_10 obj_11 obj_10)
       (pred_10 obj_11 obj_02)
       (pred_10 obj_11 obj_08)
       (pred_10 obj_10 obj_05)
       (pred_10 obj_10 obj_20)
       (pred_10 obj_10 obj_16)
       (pred_10 obj_10 obj_11)
       (pred_10 obj_20 obj_03)
       (pred_10 obj_20 obj_01)
       (pred_10 obj_20 obj_10)
       (pred_10 obj_22 obj_07)
       (pred_10 obj_22 obj_18)
       (pred_10 obj_22 obj_08)
       (pred_10 obj_18 obj_19)
       (pred_10 obj_18 obj_05)
       (pred_10 obj_18 obj_11)
       (pred_10 obj_18 obj_22)
       (pred_10 obj_05 obj_13)
       (pred_10 obj_05 obj_03)
       (pred_10 obj_05 obj_10)
       (pred_10 obj_05 obj_18)
       (pred_10 obj_03 obj_21)
       (pred_10 obj_03 obj_20)
       (pred_10 obj_03 obj_05)
       (pred_10 obj_07 obj_19)
       (pred_10 obj_07 obj_22)
       (pred_10 obj_19 obj_13)
       (pred_10 obj_19 obj_18)
       (pred_10 obj_19 obj_07)
       (pred_10 obj_13 obj_21)
       (pred_10 obj_13 obj_05)
       (pred_10 obj_13 obj_19)
       (pred_10 obj_21 obj_03)
       (pred_10 obj_21 obj_13)
       (pred_8 obj_22)
       (pred_8 obj_02)
       (pred_8 obj_08)
       (pred_6  obj_22 obj_14)
       (pred_6  obj_02 obj_17)
       (pred_6  obj_08 obj_04)
       (pred_12 obj_06)
       (pred_12 obj_16)
       (pred_12 obj_01)
       (pred_12 obj_11)
       (pred_12 obj_10)
       (pred_12 obj_20)
       (pred_12 obj_18)
       (pred_12 obj_05)
       (pred_12 obj_03)
       (pred_12 obj_07)
       (pred_12 obj_19)
       (pred_12 obj_13)
       (pred_12 obj_21)

       (pred_7  obj_09 obj_14)
       (pred_7  obj_15 obj_17)
       (pred_7  obj_12 obj_04)
       (pred_9 obj_09 obj_07)
       (pred_9 obj_15 obj_01)
       (pred_9 obj_12 obj_21)
       (pred_5 obj_01)
    )

    (:goal (and
       (pred_9 obj_09 obj_11)
       (pred_9 obj_15 obj_02)
       (pred_9 obj_12 obj_19)
    ))
(:constraints
  (always (not (pred_5 obj_13)))
)
)

; plan
1. (op_5 obj_01 obj_15)
   deleted: (pred_9 obj_15 obj_01) (pred_4)
   added: (pred_2 obj_15)
   goals met: 0 of 3
2. (op_2 obj_01 obj_16)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_16)
   goals met: 0 of 3
3. (op_4 obj_16 obj_02 obj_15 obj_17)
   deleted: (pred_8 obj_02)
   added: (pred_12 obj_02)
   goals met: 0 of 3
4. (op_2 obj_16 obj_02)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_02)
   goals met: 0 of 3
5. (op_2 obj_02 obj_11)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_11)
   goals met: 0 of 3
6. (op_3 obj_11 obj_15)
   deleted: (pred_2 obj_15)
   added: (pred_4) (pred_9 obj_15 obj_11)
   goals met: 0 of 3
7. (op_2 obj_11 obj_18)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_18)
   goals met: 0 of 3
8. (op_2 obj_18 obj_19)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_19)
   goals met: 0 of 3
9. (op_2 obj_19 obj_07)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_07)
   goals met: 0 of 3
10. (op_5 obj_07 obj_09)
   deleted: (pred_9 obj_09 obj_07) (pred_4)
   added: (pred_2 obj_09)
   goals met: 0 of 3
11. (op_2 obj_07 obj_19)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_19)
   goals met: 0 of 3
12. (op_2 obj_19 obj_18)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_18)
   goals met: 0 of 3
13. (op_2 obj_18 obj_11)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_11)
   goals met: 0 of 3
14. (op_1 obj_11 obj_15 obj_09)
   deleted: (pred_2 obj_09) (pred_9 obj_15 obj_11)
   added: (pred_2 obj_15) (pred_9 obj_09 obj_11)
   goals met: 1 of 3
15. (op_2 obj_11 obj_18)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_18)
   goals met: 1 of 3
16. (op_2 obj_18 obj_05)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_05)
   goals met: 1 of 3
17. (op_2 obj_05 obj_03)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_03)
   goals met: 1 of 3
18. (op_3 obj_03 obj_15)
   deleted: (pred_2 obj_15)
   added: (pred_4) (pred_9 obj_15 obj_03)
   goals met: 1 of 3
19. (op_2 obj_03 obj_21)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_21)
   goals met: 1 of 3
20. (op_5 obj_21 obj_12)
   deleted: (pred_9 obj_12 obj_21) (pred_4)
   added: (pred_2 obj_12)
   goals met: 1 of 3
21. (op_2 obj_21 obj_03)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_03)
   goals met: 1 of 3
22. (op_2 obj_03 obj_05)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_05)
   goals met: 1 of 3
23. (op_2 obj_05 obj_18)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_18)
   goals met: 1 of 3
24. (op_2 obj_18 obj_19)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_19)
   goals met: 1 of 3
25. (op_3 obj_19 obj_12)
   deleted: (pred_2 obj_12)
   added: (pred_4) (pred_9 obj_12 obj_19)
   goals met: 2 of 3
26. (op_2 obj_19 obj_18)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_18)
   goals met: 2 of 3
27. (op_2 obj_18 obj_05)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_05)
   goals met: 2 of 3
28. (op_2 obj_05 obj_03)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_03)
   goals met: 2 of 3
29. (op_5 obj_03 obj_15)
   deleted: (pred_9 obj_15 obj_03) (pred_4)
   added: (pred_2 obj_15)
   goals met: 2 of 3
30. (op_2 obj_03 obj_20)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_20)
   goals met: 2 of 3
31. (op_2 obj_20 obj_01)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_01)
   goals met: 2 of 3
32. (op_2 obj_01 obj_16)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_16)
   goals met: 2 of 3
33. (op_2 obj_16 obj_02)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_02)
   goals met: 2 of 3
34. (op_3 obj_02 obj_15)
   deleted: (pred_2 obj_15)
   added: (pred_4) (pred_9 obj_15 obj_02)
   goals met: 3 of 3
